Examinator/src/InformationRegisters/ПрохожденияЭлектронныхРесурсовСУЗ/ПрохожденияЭлектронныхРесурсовСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПрохожденияЭлектронныхРесурсовСУЗ</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Завершено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрольнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлеерВебКабинета</name>
    <type>
      <types>EnumRef.ПлеерыКурсовВебКабинетаСУЗ</types>
    </type>
  </attributes>
  <dimensions>
    <name>ЭлектронныйРесурс</name>
    <type>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПрохождениеОбучения</name>
    <type>
      <types>DefinedType.ПрохождениеЭлектронногоОбучения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Задание</name>
    <type>
      <types>DefinedType.ЗаданиеЭлектронногоОбучения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ПрохожденияЭлектронныхРесурсовСУЗ/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Функция ЕстьПрохожденияВПлеереВебКабинета(Знач ПроведениеОбучения, Знач ЭлектронныйРесурс, Знач ПлеерВебКабинета) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если НЕ ЗначениеЗаполнено(ПроведениеОбучения) Тогда	
		Возврат Ложь;		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПрохожденияЭлектронныхРесурсовСУЗ.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрСведений.ПрохожденияЭлектронныхРесурсовСУЗ КАК ПрохожденияЭлектронныхРесурсовСУЗ
		|ГДЕ
		|	ПрохожденияЭлектронныхРесурсовСУЗ.ЭлектронныйРесурс = &ЭлектронныйРесурс
		|	И ПрохожденияЭлектронныхРесурсовСУЗ.ПлеерВебКабинета = &ПлеерВебКабинета
		|	И ПрохожденияЭлектронныхРесурсовСУЗ.ПрохождениеОбучения.ПроведениеОбучения = &ПроведениеОбучения
		|	";
	
	Запрос.УстановитьПараметр("ПлеерВебКабинета", ПлеерВебКабинета);
	Запрос.УстановитьПараметр("ЭлектронныйРесурс", ЭлектронныйРесурс);
	Запрос.УстановитьПараметр("ПроведениеОбучения", ПроведениеОбучения);
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

#КонецОбласти

#КонецЕсли
